notes-on-making-website.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Notes on making a website with Emacs and orgmode</title>
<meta name="generator" content="Org mode">
<meta name="description" content="General notes and observations on making a website."
>
<meta name="keywords" content="notes, website">
<link rel='stylesheet' href='./css/code.css' />
<link rel='stylesheet' href='./css/simple.css' />
<link rel='shortcut icon' href='./img/favicon.ico' type='image/x-icon' />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/fork-awesome@1.2.0/css/fork-awesome.min.css' integrity='sha256-XoaMnoYC5TH6/+ihMEnospgm0J1PM/nioxbOUdnM8HY=' crossorigin='anonymous'>
</head>
<body>
<header id="top" class="status">
<a href="./index.html">shrirambo</a>.<a href="https://github.com/shrirambo">github</a>.<a href="">io</a>/<a href="./index.html">home</a>/<a href="./index.html">blog</a>
</header>
<main id="content">
<h1 class="title">Notes on making a website with Emacs and orgmode</h1>
<p>
Here lies some general things, big and small (although mostly small) that I learned while making my website.
</p>

<section id="outline-container-orge6e4c50" class="outline-2">
<h2 id="orge6e4c50"><a href="#orge6e4c50">The root dir</a></h2>
<div class="outline-text-2" id="text-orge6e4c50">
<p>
When hosting a website, we can add links (e.g. links to some css or jacascript files) in the header. The path used can be relative to the document. This becomes a trouble when the html pages are in complicated directory structure.
</p>
<pre class="example">
/-  project
|---css
|    |---style.css
|---page1.html
|---folder1
|    |---page2.html
|---folder2
|     |---folder3
|     |      |---page3.html
</pre>

<p>
In the above tree structure, <code>page1.html</code> will can have relative path for stylesheet as <code>./css/style.css</code>, while <code>page2.html</code> will have <code>./../css/style.css</code> and <code>page3.html</code> will have <code>./../../css/style.css</code>. Then it is easier to put absolute path <code>~/abs/path/to/project/css/style.css</code> and this stays constant in all of the html files. 
</p>

<p>
The root dir for http server is the folder where it is started. If the web server is started in the <code>project</code> directory, each html can hace <code>/css/style.css</code> as the path to stylesheet. Now, our life is much simpler than it was. 
</p>
</div>

<div id="outline-container-org0644019" class="outline-3">
<h3 id="org0644019"><a href="#org0644019">Github pages caveat</a></h3>
<div class="outline-text-3" id="text-org0644019">
<p>
On github, we can host static html sites. The root dir for the http server hosting our site is <code>[username].github.io</code>. If we have another repo called <code>blog-post</code> with github pages enabled, then all the content of this repo will be added to <code>root/blog-post</code> i.e. <code>[username].github.io/blogpost</code>. The html file (say <code>page1.html</code> which in in working dir of blog-post repo), which has <code>/css/style.css/</code> in its head will look for the css file in <code>[username].github.io/css/style.css</code>. Therefore, if the html page repo is not  <code>[username].github.io</code>, then it will no be able to load resources. So we can either keep our resources in <code>[username].github.io</code> repo or keep the resources path absolute according to where the http server is hosted.
</p>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<section>
<script src="https://giscus.app/client.js" 
  data-repo="ShriRambo/giscus-comments"
  data-repo-id="R_kgDOG1mtrQ"
  data-category="Announcements" 
  data-category-id="DIC_kwDOG1mtrc4CBJNW" 
  data-mapping="title" 
  data-reactions-enabled="1" 
  data-emit-metadata="0" 
  data-input-position="top" 
  data-theme="dark" 
  data-lang="en" 
  crossorigin="anonymous" 
  async> </script>
</section>
<hr>
<section>
  <p style="text-align:center">
Made with ❤️ and Emacs (Org-mode)
</p>
<div align=center>
  <a href="#" class='link-icon'>
    <i class="fa fa-home fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://www.instagram.com/shrirambo/" class='link-icon'>
    <i class="fa fa-instagram fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://github.com/shrirambo" class='link-icon'>
    <i class="fa fa-github fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://www.linkedin.com/in/shriram-ashirgade/' class='link-icon'>
    <i class="fa fa-linkedin-square fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://social.vivaldi.net/@shrirambo'>
    <i class="fa fa-mastodon fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://github.com/ShriRambo/sturdy-octo-winner/tree/master/content' class='link-icon'>
    <i class="fa fa-code  fa-lg" aria-hidden="true"></i>
  </a>
  <a href='#content' class='link-icon'>
    <i class="fa fa-hand-o-up  fa-lg" aria-hidden="true"></i>
  </a>
</div>
</div>
</footer>
</body>
</html>
